# vstDrawCoordEllipse

```pascal
PROCEDURE vstDrawCoordEllipse(
				ptLeftTopX,ptLeftTopY : REAL;
				ptRghtBotX,ptRghtBotY : REAL);
```

```python
def vs.vstDrawCoordEllipse(ptLeftTopX, ptLeftTopY, ptRghtBotX, ptRghtBotY):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|ptLeftTop, ptLeftTop|REAL|   |
|ptRghtBotX, ptRghtBotY|REAL|   |

## Version
Availability: from Vectorworks 2011

## Category
* Tool Events